# IsDefault Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..IsDefault Property
PanelScheduleTemplate Class See Also
---
Checks to see if this is default template for the given panel schedule type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsDefault { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDefault As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDefault {
	bool get ();
}
```

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace